using System;
using System.Linq;

namespace Lesson_5Lab4
{
    class Program
    {
        //Задание 3.Параметр Ref(параметры ввода - вывода)
        //Выполнить: Создайте функцию MinmaxSeq(), которая принимает два аргумента по ссылке(ref аргументы) — минимальное и максимальное значение вводимой последовательности чисел.
        //Запросите у пользователя ввести последовательность, которая должна закончиться 0(если вводится 0, то ввод завершается).
        //Функция должна выполнять поиск максимального и минимального значения последовательности и возвращать результат.

        //Указание 1: Функция не должна возвращать значениен(поэтому в объявлении функции используется void).
        //Параметры ref — это параметры ввода - вывода, это говорит о том, что значения этих параметров меняются внутри функции и возвращаются в основную программу с вызовом фнукции.
        //Указание 2: Необходимо использовать ключевое слово static в объявлении метиода, так как функция Main тоже статическая,
        //а нестатическая фнукция не может быть вызвана внутри статической.

        //Пример вывода:

        //Введите полседовательность и закончите ввод нулем:
        //2 4 8 3 0
        //минимальное: 2, максимальное: 8
        static void Main(string[] args)
        {
            int max = int.MinValue;

            int min = int.MaxValue;

            MinmaxSeq(ref max, ref min);

            Console.WriteLine($"min: {min}\nmax: {max}");
        }

        private static void MinmaxSeq(ref int max, ref int min)
        {
            Console.WriteLine("Введите последовательность и закончите ввод нулем");

            int a;

            do
            {
                a = Convert.ToInt32(Console.ReadLine());
            }

            while (a != 0);
            {
                if (a > max && a != 0)
                    max = a;

                if (a < min && a != 0)
                    min = a;
            }
        }
    }
}
